applications/solvers/mySolver/pimpleFoam/RAS/propeller1/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dynamicFvMesh   dynamicMotionSolverFvMesh;
dynamicFvMesh   staticFvMesh;

motionSolverLibs (fvMotionSolvers);

motionSolver    solidBody;

cellZone        innerCylinderSmall;

solidBodyMotionFunction  rotatingMotion;

origin      (0 0 0);
axis        (1 0 0);

omega       -158;  // rad/s (negative since it is a left-hand propeller)


// ************************************************************************* //
